In [1]:
import pandas as pd

In [2]:
data = {
    'Nombre': ['Ana', 'Luis', 'Sofia', 'Carlos', 'María'],
    'Edad': [23, 21, 22, 24, 20],
    'Carrera': ['Ingeniería', 'Medicina', 'Arquitectura', 'Derecho', 'Psicología'],
    'Promedio': [9.1, 8.5, 8.7, 9.0, 9.3],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla', 'Bilbao']
}


df = pd.DataFrame(data)
df.head()

   Nombre  Edad       Carrera  Promedio     Ciudad
0     Ana    23    Ingeniería       9.1     Madrid
1    Luis    21      Medicina       8.5  Barcelona
2   Sofia    22  Arquitectura       8.7   Valencia
3  Carlos    24       Derecho       9.0    Sevilla
4   María    20    Psicología       9.3     Bilbao

In [3]:
df.iloc[1, 1:3]   #Usamos iloc para sacar el valor 21 y Medicina

Edad             21
Carrera    Medicina
Name: 1, dtype: object

In [4]:
df.iloc[:,3] #Queremos la columna promedio

0    9.1
1    8.5
2    8.7
3    9.0
4    9.3
Name: Promedio, dtype: float64

In [8]:
df.loc[4, ["Nombre", "Carrera"]]  #Usando loc queremos sacar María y psicología

Nombre          María
Carrera    Psicología
Name: 4, dtype: object

In [9]:
df = pd.DataFrame(data, index= ["al1", "al2", "al3", "al4", "al5"])  #Usamos index para poner los índices que queramos (para q sea más facil)
df.head()

     Nombre  Edad       Carrera  Promedio     Ciudad
al1     Ana    23    Ingeniería       9.1     Madrid
al2    Luis    21      Medicina       8.5  Barcelona
al3   Sofia    22  Arquitectura       8.7   Valencia
al4  Carlos    24       Derecho       9.0    Sevilla
al5   María    20    Psicología       9.3     Bilbao

In [10]:
df.loc["al1", ["Carrera", "Promedio"]]        #Usando loc con el nuevo index

Carrera     Ingeniería
Promedio           9.1
Name: al1, dtype: object

In [11]:
df.iloc[0, 2:4]    #Usando iloc con el nuevo index

Carrera     Ingeniería
Promedio           9.1
Name: al1, dtype: object

In [13]:
df.iloc[:, 2:5]     #Usando iloc recuerda que el último número del rango no lo incluye
df.iloc[:, -3:]    #Para que nos coja todos no ponemos -1 porque sino Ciudad no lo coge

          Carrera  Promedio     Ciudad
al1    Ingeniería       9.1     Madrid
al2      Medicina       8.5  Barcelona
al3  Arquitectura       8.7   Valencia
al4       Derecho       9.0    Sevilla
al5    Psicología       9.3     Bilbao

In [15]:
df.iloc[[2,4], :]    #Para que nos coja todas las columnas de María y Sofía

    Nombre  Edad       Carrera  Promedio    Ciudad
al3  Sofia    22  Arquitectura       8.7  Valencia
al5  María    20    Psicología       9.3    Bilbao

In [16]:
df.iloc[::2, :]   #Para que nos coja todas las columnas de Ana, María y Sofía [START, STOP STEP]=[:, :, 2]

    Nombre  Edad       Carrera  Promedio    Ciudad
al1    Ana    23    Ingeniería       9.1    Madrid
al3  Sofia    22  Arquitectura       8.7  Valencia
al5  María    20    Psicología       9.3    Bilbao